GopalSaraf/Practicals/PSDL/include/proc/pic18f57k42.h
extern volatile SPI1SCKPPSbits_t SPI1SCKPPSbits __at(0x3ADE);
// bitfield macros
#define _SPI1SCKPPS_SPI1SCKPPS_POSN                         0x0
#define _SPI1SCKPPS_SPI1SCKPPS_POSITION                     0x0
#define _SPI1SCKPPS_SPI1SCKPPS_SIZE                         0x6
#define _SPI1SCKPPS_SPI1SCKPPS_LENGTH                       0x6
#define _SPI1SCKPPS_SPI1SCKPPS_MASK                         0x3F

// Register: SPI1SDIPPS
#define SPI1SDIPPS SPI1SDIPPS
extern volatile unsigned char           SPI1SDIPPS          __at(0x3ADF);
#ifndef _LIB_BUILD
asm("SPI1SDIPPS equ 03ADFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SPI1SDIPPS             :6;
    };
} SPI1SDIPPSbits_t;
extern volatile SPI1SDIPPSbits_t SPI1SDIPPSbits __at(0x3ADF);
// bitfield macros
#define _SPI1SDIPPS_SPI1SDIPPS_POSN                         0x0
#define _SPI1SDIPPS_SPI1SDIPPS_POSITION                     0x0
#define _SPI1SDIPPS_SPI1SDIPPS_SIZE                         0x6
#define _SPI1SDIPPS_SPI1SDIPPS_LENGTH                       0x6
#define _SPI1SDIPPS_SPI1SDIPPS_MASK                         0x3F

// Register: SPI1SSPPS
#define SPI1SSPPS SPI1SSPPS
extern volatile unsigned char           SPI1SSPPS           __at(0x3AE0);
#ifndef _LIB_BUILD
asm("SPI1SSPPS equ 03AE0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SPI1SSPPS              :6;
    };
} SPI1SSPPSbits_t;
extern volatile SPI1SSPPSbits_t SPI1SSPPSbits __at(0x3AE0);
// bitfield macros
#define _SPI1SSPPS_SPI1SSPPS_POSN                           0x0
#define _SPI1SSPPS_SPI1SSPPS_POSITION                       0x0
#define _SPI1SSPPS_SPI1SSPPS_SIZE                           0x6
#define _SPI1SSPPS_SPI1SSPPS_LENGTH                         0x6
#define _SPI1SSPPS_SPI1SSPPS_MASK                           0x3F

// Register: I2C1SCLPPS
#define I2C1SCLPPS I2C1SCLPPS
extern volatile unsigned char           I2C1SCLPPS          __at(0x3AE1);
#ifndef _LIB_BUILD
asm("I2C1SCLPPS equ 03AE1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned I2C1SCLPPS             :6;
    };
} I2C1SCLPPSbits_t;
extern volatile I2C1SCLPPSbits_t I2C1SCLPPSbits __at(0x3AE1);
// bitfield macros
#define _I2C1SCLPPS_I2C1SCLPPS_POSN                         0x0
#define _I2C1SCLPPS_I2C1SCLPPS_POSITION                     0x0
#define _I2C1SCLPPS_I2C1SCLPPS_SIZE                         0x6
#define _I2C1SCLPPS_I2C1SCLPPS_LENGTH                       0x6
#define _I2C1SCLPPS_I2C1SCLPPS_MASK                         0x3F

// Register: I2C1SDAPPS
#define I2C1SDAPPS I2C1SDAPPS
extern volatile unsigned char           I2C1SDAPPS          __at(0x3AE2);
#ifndef _LIB_BUILD
asm("I2C1SDAPPS equ 03AE2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned I2C1SDAPPS             :6;
    };
} I2C1SDAPPSbits_t;
extern volatile I2C1SDAPPSbits_t I2C1SDAPPSbits __at(0x3AE2);
// bitfield macros
#define _I2C1SDAPPS_I2C1SDAPPS_POSN                         0x0
#define _I2C1SDAPPS_I2C1SDAPPS_POSITION                     0x0
#define _I2C1SDAPPS_I2C1SDAPPS_SIZE                         0x6
#define _I2C1SDAPPS_I2C1SDAPPS_LENGTH                       0x6
#define _I2C1SDAPPS_I2C1SDAPPS_MASK                         0x3F

// Register: I2C2SCLPPS
#define I2C2SCLPPS I2C2SCLPPS
extern volatile unsigned char           I2C2SCLPPS          __at(0x3AE3);
#ifndef _LIB_BUILD
asm("I2C2SCLPPS equ 03AE3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned I2C2SCLPPS             :6;
    };
} I2C2SCLPPSbits_t;
extern volatile I2C2SCLPPSbits_t I2C2SCLPPSbits __at(0x3AE3);
// bitfield macros
#define _I2C2SCLPPS_I2C2SCLPPS_POSN                         0x0
#define _I2C2SCLPPS_I2C2SCLPPS_POSITION                     0x0
#define _I2C2SCLPPS_I2C2SCLPPS_SIZE                         0x6
#define _I2C2SCLPPS_I2C2SCLPPS_LENGTH                       0x6
#define _I2C2SCLPPS_I2C2SCLPPS_MASK                         0x3F

// Register: I2C2SDAPPS
#define I2C2SDAPPS I2C2SDAPPS
extern volatile unsigned char           I2C2SDAPPS          __at(0x3AE4);
#ifndef _LIB_BUILD
asm("I2C2SDAPPS equ 03AE4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned I2C2SDAPPS             :6;
    };
} I2C2SDAPPSbits_t;
extern volatile I2C2SDAPPSbits_t I2C2SDAPPSbits __at(0x3AE4);
// bitfield macros
#define _I2C2SDAPPS_I2C2SDAPPS_POSN                         0x0
#define _I2C2SDAPPS_I2C2SDAPPS_POSITION                     0x0
#define _I2C2SDAPPS_I2C2SDAPPS_SIZE                         0x6
#define _I2C2SDAPPS_I2C2SDAPPS_LENGTH                       0x6
#define _I2C2SDAPPS_I2C2SDAPPS_MASK                         0x3F

// Register: U1RXPPS
#define U1RXPPS U1RXPPS
extern volatile unsigned char           U1RXPPS             __at(0x3AE5);
#ifndef _LIB_BUILD
asm("U1RXPPS equ 03AE5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned U1RXPPS                :6;
    };
} U1RXPPSbits_t;
extern volatile U1RXPPSbits_t U1RXPPSbits __at(0x3AE5);
// bitfield macros
#define _U1RXPPS_U1RXPPS_POSN                               0x0
#define _U1RXPPS_U1RXPPS_POSITION                           0x0
#define _U1RXPPS_U1RXPPS_SIZE                               0x6
#define _U1RXPPS_U1RXPPS_LENGTH                             0x6
#define _U1RXPPS_U1RXPPS_MASK                               0x3F

// Register: U1CTSPPS
#define U1CTSPPS U1CTSPPS
extern volatile unsigned char           U1CTSPPS            __at(0x3AE6);
#ifndef _LIB_BUILD
asm("U1CTSPPS equ 03AE6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned U1CTSPPS               :6;
    };
} U1CTSPPSbits_t;
extern volatile U1CTSPPSbits_t U1CTSPPSbits __at(0x3AE6);
// bitfield macros
#define _U1CTSPPS_U1CTSPPS_POSN                             0x0
#define _U1CTSPPS_U1CTSPPS_POSITION                         0x0
#define _U1CTSPPS_U1CTSPPS_SIZE                             0x6
#define _U1CTSPPS_U1CTSPPS_LENGTH                           0x6
#define _U1CTSPPS_U1CTSPPS_MASK                             0x3F

