GopalSaraf/Practicals/PSDL/include/proc/pic18f57k42.h
// Register: U1RXCHK
#define U1RXCHK U1RXCHK
extern volatile unsigned char           U1RXCHK             __at(0x3DE9);
#ifndef _LIB_BUILD
asm("U1RXCHK equ 03DE9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXCHK                  :8;
    };
} U1RXCHKbits_t;
extern volatile U1RXCHKbits_t U1RXCHKbits __at(0x3DE9);
// bitfield macros
#define _U1RXCHK_RXCHK_POSN                                 0x0
#define _U1RXCHK_RXCHK_POSITION                             0x0
#define _U1RXCHK_RXCHK_SIZE                                 0x8
#define _U1RXCHK_RXCHK_LENGTH                               0x8
#define _U1RXCHK_RXCHK_MASK                                 0xFF

// Register: U1TXB
#define U1TXB U1TXB
extern volatile unsigned char           U1TXB               __at(0x3DEA);
#ifndef _LIB_BUILD
asm("U1TXB equ 03DEAh");
#endif
// aliases
extern volatile unsigned char           U1TXBL              __at(0x3DEA);
#ifndef _LIB_BUILD
asm("U1TXBL equ 03DEAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXB                    :8;
    };
} U1TXBbits_t;
extern volatile U1TXBbits_t U1TXBbits __at(0x3DEA);
// bitfield macros
#define _U1TXB_TXB_POSN                                     0x0
#define _U1TXB_TXB_POSITION                                 0x0
#define _U1TXB_TXB_SIZE                                     0x8
#define _U1TXB_TXB_LENGTH                                   0x8
#define _U1TXB_TXB_MASK                                     0xFF
// alias bitfield definitions
typedef union {
    struct {
        unsigned TXB                    :8;
    };
} U1TXBLbits_t;
extern volatile U1TXBLbits_t U1TXBLbits __at(0x3DEA);
// bitfield macros
#define _U1TXBL_TXB_POSN                                    0x0
#define _U1TXBL_TXB_POSITION                                0x0
#define _U1TXBL_TXB_SIZE                                    0x8
#define _U1TXBL_TXB_LENGTH                                  0x8
#define _U1TXBL_TXB_MASK                                    0xFF

// Register: U1TXCHK
#define U1TXCHK U1TXCHK
extern volatile unsigned char           U1TXCHK             __at(0x3DEB);
#ifndef _LIB_BUILD
asm("U1TXCHK equ 03DEBh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXCHK                  :8;
    };
} U1TXCHKbits_t;
extern volatile U1TXCHKbits_t U1TXCHKbits __at(0x3DEB);
// bitfield macros
#define _U1TXCHK_TXCHK_POSN                                 0x0
#define _U1TXCHK_TXCHK_POSITION                             0x0
#define _U1TXCHK_TXCHK_SIZE                                 0x8
#define _U1TXCHK_TXCHK_LENGTH                               0x8
#define _U1TXCHK_TXCHK_MASK                                 0xFF

// Register: U1P1
#define U1P1 U1P1
extern volatile unsigned short          U1P1                __at(0x3DEC);
#ifndef _LIB_BUILD
asm("U1P1 equ 03DECh");
#endif

// Register: U1P1L
#define U1P1L U1P1L
extern volatile unsigned char           U1P1L               __at(0x3DEC);
#ifndef _LIB_BUILD
asm("U1P1L equ 03DECh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P1L                    :8;
    };
} U1P1Lbits_t;
extern volatile U1P1Lbits_t U1P1Lbits __at(0x3DEC);
// bitfield macros
#define _U1P1L_P1L_POSN                                     0x0
#define _U1P1L_P1L_POSITION                                 0x0
#define _U1P1L_P1L_SIZE                                     0x8
#define _U1P1L_P1L_LENGTH                                   0x8
#define _U1P1L_P1L_MASK                                     0xFF

// Register: U1P1H
#define U1P1H U1P1H
extern volatile unsigned char           U1P1H               __at(0x3DED);
#ifndef _LIB_BUILD
asm("U1P1H equ 03DEDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P1H                    :1;
    };
} U1P1Hbits_t;
extern volatile U1P1Hbits_t U1P1Hbits __at(0x3DED);
// bitfield macros
#define _U1P1H_P1H_POSN                                     0x0
#define _U1P1H_P1H_POSITION                                 0x0
#define _U1P1H_P1H_SIZE                                     0x1
#define _U1P1H_P1H_LENGTH                                   0x1
#define _U1P1H_P1H_MASK                                     0x1

// Register: U1P2
#define U1P2 U1P2
extern volatile unsigned short          U1P2                __at(0x3DEE);
#ifndef _LIB_BUILD
asm("U1P2 equ 03DEEh");
#endif

// Register: U1P2L
#define U1P2L U1P2L
extern volatile unsigned char           U1P2L               __at(0x3DEE);
#ifndef _LIB_BUILD
asm("U1P2L equ 03DEEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P2L                    :8;
    };
} U1P2Lbits_t;
extern volatile U1P2Lbits_t U1P2Lbits __at(0x3DEE);
// bitfield macros
#define _U1P2L_P2L_POSN                                     0x0
#define _U1P2L_P2L_POSITION                                 0x0
#define _U1P2L_P2L_SIZE                                     0x8
#define _U1P2L_P2L_LENGTH                                   0x8
#define _U1P2L_P2L_MASK                                     0xFF

// Register: U1P2H
#define U1P2H U1P2H
extern volatile unsigned char           U1P2H               __at(0x3DEF);
#ifndef _LIB_BUILD
asm("U1P2H equ 03DEFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P2H                    :1;
    };
} U1P2Hbits_t;
extern volatile U1P2Hbits_t U1P2Hbits __at(0x3DEF);
// bitfield macros
#define _U1P2H_P2H_POSN                                     0x0
#define _U1P2H_P2H_POSITION                                 0x0
#define _U1P2H_P2H_SIZE                                     0x1
#define _U1P2H_P2H_LENGTH                                   0x1
#define _U1P2H_P2H_MASK                                     0x1

// Register: U1P3
#define U1P3 U1P3
extern volatile unsigned short          U1P3                __at(0x3DF0);
#ifndef _LIB_BUILD
asm("U1P3 equ 03DF0h");
#endif

// Register: U1P3L
#define U1P3L U1P3L
extern volatile unsigned char           U1P3L               __at(0x3DF0);
#ifndef _LIB_BUILD
asm("U1P3L equ 03DF0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P3L                    :8;
    };
} U1P3Lbits_t;
