GopalSaraf/Practicals/PSDL/include/proc/pic18f57k42.h
#define                                 WDTPSCNT8_bit       _BIT_ACCESS(WDTPSH,0)
// WDTPSH<WDTPSCNT9>
extern volatile __bit                   WDTPSCNT9           __at(0x1CAF1);	// @ (0x395E * 8 + 1)
#define                                 WDTPSCNT9_bit       _BIT_ACCESS(WDTPSH,1)
// WDTCON0<WDTSEN>
extern volatile __bit                   WDTSEN              __at(0x1CAD8);	// @ (0x395B * 8 + 0)
#define                                 WDTSEN_bit          _BIT_ACCESS(WDTCON0,0)
// WDTTMR<WDTSTATE>
extern volatile __bit                   WDTSTATE            __at(0x1CAFA);	// @ (0x395F * 8 + 2)
#define                                 WDTSTATE_bit        _BIT_ACCESS(WDTTMR,2)
// WDTTMR<WDTTMR0>
extern volatile __bit                   WDTTMR0             __at(0x1CAFB);	// @ (0x395F * 8 + 3)
#define                                 WDTTMR0_bit         _BIT_ACCESS(WDTTMR,3)
// WDTTMR<WDTTMR1>
extern volatile __bit                   WDTTMR1             __at(0x1CAFC);	// @ (0x395F * 8 + 4)
#define                                 WDTTMR1_bit         _BIT_ACCESS(WDTTMR,4)
// WDTTMR<WDTTMR2>
extern volatile __bit                   WDTTMR2             __at(0x1CAFD);	// @ (0x395F * 8 + 5)
#define                                 WDTTMR2_bit         _BIT_ACCESS(WDTTMR,5)
// WDTTMR<WDTTMR3>
extern volatile __bit                   WDTTMR3             __at(0x1CAFE);	// @ (0x395F * 8 + 6)
#define                                 WDTTMR3_bit         _BIT_ACCESS(WDTTMR,6)
// WDTTMR<WDTTMR4>
extern volatile __bit                   WDTTMR4             __at(0x1CAFF);	// @ (0x395F * 8 + 7)
#define                                 WDTTMR4_bit         _BIT_ACCESS(WDTTMR,7)
// WDTCON1<WDTWINDOW0>
extern volatile __bit                   WDTWINDOW0          __at(0x1CAE0);	// @ (0x395C * 8 + 0)
#define                                 WDTWINDOW0_bit      _BIT_ACCESS(WDTCON1,0)
// WDTCON1<WDTWINDOW1>
extern volatile __bit                   WDTWINDOW1          __at(0x1CAE1);	// @ (0x395C * 8 + 1)
#define                                 WDTWINDOW1_bit      _BIT_ACCESS(WDTCON1,1)
// WDTCON1<WDTWINDOW2>
extern volatile __bit                   WDTWINDOW2          __at(0x1CAE2);	// @ (0x395C * 8 + 2)
#define                                 WDTWINDOW2_bit      _BIT_ACCESS(WDTCON1,2)
// PCON0<WDTWV>
extern volatile __bit                   WDTWV               __at(0x1FF85);	// @ (0x3FF0 * 8 + 5)
#define                                 WDTWV_bit           _BIT_ACCESS(PCON0,5)
// WDTCON1<WINDOW0>
extern volatile __bit                   WINDOW0             __at(0x1CAE0);	// @ (0x395C * 8 + 0)
#define                                 WINDOW0_bit         _BIT_ACCESS(WDTCON1,0)
// WDTCON1<WINDOW1>
extern volatile __bit                   WINDOW1             __at(0x1CAE1);	// @ (0x395C * 8 + 1)
#define                                 WINDOW1_bit         _BIT_ACCESS(WDTCON1,1)
// WDTCON1<WINDOW2>
extern volatile __bit                   WINDOW2             __at(0x1CAE2);	// @ (0x395C * 8 + 2)
#define                                 WINDOW2_bit         _BIT_ACCESS(WDTCON1,2)
// SMT1CON0<WPOL>
extern volatile __bit                   WPOL                __at(0x1F8F4);	// @ (0x3F1E * 8 + 4)
#define                                 WPOL_bit            _BIT_ACCESS(SMT1CON0,4)
// WPUA<WPUA0>
extern volatile __bit                   WPUA0               __at(0x1D208);	// @ (0x3A41 * 8 + 0)
#define                                 WPUA0_bit           _BIT_ACCESS(WPUA,0)
// WPUA<WPUA1>
extern volatile __bit                   WPUA1               __at(0x1D209);	// @ (0x3A41 * 8 + 1)
#define                                 WPUA1_bit           _BIT_ACCESS(WPUA,1)
// WPUA<WPUA2>
extern volatile __bit                   WPUA2               __at(0x1D20A);	// @ (0x3A41 * 8 + 2)
#define                                 WPUA2_bit           _BIT_ACCESS(WPUA,2)
// WPUA<WPUA3>
extern volatile __bit                   WPUA3               __at(0x1D20B);	// @ (0x3A41 * 8 + 3)
#define                                 WPUA3_bit           _BIT_ACCESS(WPUA,3)
// WPUA<WPUA4>
extern volatile __bit                   WPUA4               __at(0x1D20C);	// @ (0x3A41 * 8 + 4)
#define                                 WPUA4_bit           _BIT_ACCESS(WPUA,4)
// WPUA<WPUA5>
extern volatile __bit                   WPUA5               __at(0x1D20D);	// @ (0x3A41 * 8 + 5)
#define                                 WPUA5_bit           _BIT_ACCESS(WPUA,5)
// WPUA<WPUA6>
extern volatile __bit                   WPUA6               __at(0x1D20E);	// @ (0x3A41 * 8 + 6)
#define                                 WPUA6_bit           _BIT_ACCESS(WPUA,6)
// WPUA<WPUA7>
extern volatile __bit                   WPUA7               __at(0x1D20F);	// @ (0x3A41 * 8 + 7)
#define                                 WPUA7_bit           _BIT_ACCESS(WPUA,7)
// WPUB<WPUB0>
extern volatile __bit                   WPUB0               __at(0x1D288);	// @ (0x3A51 * 8 + 0)
#define                                 WPUB0_bit           _BIT_ACCESS(WPUB,0)
// WPUB<WPUB1>
extern volatile __bit                   WPUB1               __at(0x1D289);	// @ (0x3A51 * 8 + 1)
#define                                 WPUB1_bit           _BIT_ACCESS(WPUB,1)
// WPUB<WPUB2>
extern volatile __bit                   WPUB2               __at(0x1D28A);	// @ (0x3A51 * 8 + 2)
#define                                 WPUB2_bit           _BIT_ACCESS(WPUB,2)
// WPUB<WPUB3>
extern volatile __bit                   WPUB3               __at(0x1D28B);	// @ (0x3A51 * 8 + 3)
#define                                 WPUB3_bit           _BIT_ACCESS(WPUB,3)
// WPUB<WPUB4>
extern volatile __bit                   WPUB4               __at(0x1D28C);	// @ (0x3A51 * 8 + 4)
#define                                 WPUB4_bit           _BIT_ACCESS(WPUB,4)
// WPUB<WPUB5>
extern volatile __bit                   WPUB5               __at(0x1D28D);	// @ (0x3A51 * 8 + 5)
#define                                 WPUB5_bit           _BIT_ACCESS(WPUB,5)
// WPUB<WPUB6>
extern volatile __bit                   WPUB6               __at(0x1D28E);	// @ (0x3A51 * 8 + 6)
#define                                 WPUB6_bit           _BIT_ACCESS(WPUB,6)
// WPUB<WPUB7>
extern volatile __bit                   WPUB7               __at(0x1D28F);	// @ (0x3A51 * 8 + 7)
#define                                 WPUB7_bit           _BIT_ACCESS(WPUB,7)
// WPUC<WPUC0>
extern volatile __bit                   WPUC0               __at(0x1D308);	// @ (0x3A61 * 8 + 0)
#define                                 WPUC0_bit           _BIT_ACCESS(WPUC,0)
// WPUC<WPUC1>
extern volatile __bit                   WPUC1               __at(0x1D309);	// @ (0x3A61 * 8 + 1)
#define                                 WPUC1_bit           _BIT_ACCESS(WPUC,1)
// WPUC<WPUC2>
extern volatile __bit                   WPUC2               __at(0x1D30A);	// @ (0x3A61 * 8 + 2)
#define                                 WPUC2_bit           _BIT_ACCESS(WPUC,2)
// WPUC<WPUC3>
extern volatile __bit                   WPUC3               __at(0x1D30B);	// @ (0x3A61 * 8 + 3)
#define                                 WPUC3_bit           _BIT_ACCESS(WPUC,3)
// WPUC<WPUC4>
extern volatile __bit                   WPUC4               __at(0x1D30C);	// @ (0x3A61 * 8 + 4)
#define                                 WPUC4_bit           _BIT_ACCESS(WPUC,4)
// WPUC<WPUC5>
extern volatile __bit                   WPUC5               __at(0x1D30D);	// @ (0x3A61 * 8 + 5)
#define                                 WPUC5_bit           _BIT_ACCESS(WPUC,5)
// WPUC<WPUC6>
extern volatile __bit                   WPUC6               __at(0x1D30E);	// @ (0x3A61 * 8 + 6)
#define                                 WPUC6_bit           _BIT_ACCESS(WPUC,6)
// WPUC<WPUC7>
extern volatile __bit                   WPUC7               __at(0x1D30F);	// @ (0x3A61 * 8 + 7)
#define                                 WPUC7_bit           _BIT_ACCESS(WPUC,7)
// WPUD<WPUD0>
extern volatile __bit                   WPUD0               __at(0x1D388);	// @ (0x3A71 * 8 + 0)
#define                                 WPUD0_bit           _BIT_ACCESS(WPUD,0)
// WPUD<WPUD1>
extern volatile __bit                   WPUD1               __at(0x1D389);	// @ (0x3A71 * 8 + 1)
#define                                 WPUD1_bit           _BIT_ACCESS(WPUD,1)
// WPUD<WPUD2>
extern volatile __bit                   WPUD2               __at(0x1D38A);	// @ (0x3A71 * 8 + 2)
#define                                 WPUD2_bit           _BIT_ACCESS(WPUD,2)
// WPUD<WPUD3>
extern volatile __bit                   WPUD3               __at(0x1D38B);	// @ (0x3A71 * 8 + 3)
#define                                 WPUD3_bit           _BIT_ACCESS(WPUD,3)
// WPUD<WPUD4>
extern volatile __bit                   WPUD4               __at(0x1D38C);	// @ (0x3A71 * 8 + 4)
#define                                 WPUD4_bit           _BIT_ACCESS(WPUD,4)
// WPUD<WPUD5>
extern volatile __bit                   WPUD5               __at(0x1D38D);	// @ (0x3A71 * 8 + 5)
#define                                 WPUD5_bit           _BIT_ACCESS(WPUD,5)
// WPUD<WPUD6>
extern volatile __bit                   WPUD6               __at(0x1D38E);	// @ (0x3A71 * 8 + 6)
#define                                 WPUD6_bit           _BIT_ACCESS(WPUD,6)
// WPUD<WPUD7>
extern volatile __bit                   WPUD7               __at(0x1D38F);	// @ (0x3A71 * 8 + 7)
#define                                 WPUD7_bit           _BIT_ACCESS(WPUD,7)
// WPUE<WPUE0>
extern volatile __bit                   WPUE0               __at(0x1D408);	// @ (0x3A81 * 8 + 0)
#define                                 WPUE0_bit           _BIT_ACCESS(WPUE,0)
// WPUE<WPUE1>
extern volatile __bit                   WPUE1               __at(0x1D409);	// @ (0x3A81 * 8 + 1)
#define                                 WPUE1_bit           _BIT_ACCESS(WPUE,1)
// WPUE<WPUE2>
extern volatile __bit                   WPUE2               __at(0x1D40A);	// @ (0x3A81 * 8 + 2)
#define                                 WPUE2_bit           _BIT_ACCESS(WPUE,2)
// WPUE<WPUE3>
extern volatile __bit                   WPUE3               __at(0x1D40B);	// @ (0x3A81 * 8 + 3)
#define                                 WPUE3_bit           _BIT_ACCESS(WPUE,3)
// WPUF<WPUF0>
extern volatile __bit                   WPUF0               __at(0x1D488);	// @ (0x3A91 * 8 + 0)
#define                                 WPUF0_bit           _BIT_ACCESS(WPUF,0)
// WPUF<WPUF1>
extern volatile __bit                   WPUF1               __at(0x1D489);	// @ (0x3A91 * 8 + 1)
#define                                 WPUF1_bit           _BIT_ACCESS(WPUF,1)
// WPUF<WPUF2>
extern volatile __bit                   WPUF2               __at(0x1D48A);	// @ (0x3A91 * 8 + 2)
#define                                 WPUF2_bit           _BIT_ACCESS(WPUF,2)
// WPUF<WPUF3>
extern volatile __bit                   WPUF3               __at(0x1D48B);	// @ (0x3A91 * 8 + 3)
#define                                 WPUF3_bit           _BIT_ACCESS(WPUF,3)
// WPUF<WPUF4>
extern volatile __bit                   WPUF4               __at(0x1D48C);	// @ (0x3A91 * 8 + 4)
#define                                 WPUF4_bit           _BIT_ACCESS(WPUF,4)
// WPUF<WPUF5>
extern volatile __bit                   WPUF5               __at(0x1D48D);	// @ (0x3A91 * 8 + 5)
#define                                 WPUF5_bit           _BIT_ACCESS(WPUF,5)
// WPUF<WPUF6>
extern volatile __bit                   WPUF6               __at(0x1D48E);	// @ (0x3A91 * 8 + 6)
#define                                 WPUF6_bit           _BIT_ACCESS(WPUF,6)
// WPUF<WPUF7>
extern volatile __bit                   WPUF7               __at(0x1D48F);	// @ (0x3A91 * 8 + 7)
#define                                 WPUF7_bit           _BIT_ACCESS(WPUF,7)
// NVMCON1<WR>
extern volatile __bit                   WR                  __at(0x1CF29);	// @ (0x39E5 * 8 + 1)
#define                                 WR_bit              _BIT_ACCESS(NVMCON1,1)
// I2C1PIE<WR1IE>
extern volatile __bit                   WR1IE               __at(0x1EBD4);	// @ (0x3D7A * 8 + 4)
#define                                 WR1IE_bit           _BIT_ACCESS(I2C1PIE,4)
// I2C1PIR<WR1IF>
extern volatile __bit                   WR1IF               __at(0x1EBCC);	// @ (0x3D79 * 8 + 4)
#define                                 WR1IF_bit           _BIT_ACCESS(I2C1PIR,4)
// I2C2PIE<WR2IE>
extern volatile __bit                   WR2IE               __at(0x1EB24);	// @ (0x3D64 * 8 + 4)
#define                                 WR2IE_bit           _BIT_ACCESS(I2C2PIE,4)
// I2C2PIR<WR2IF>
extern volatile __bit                   WR2IF               __at(0x1EB1C);	// @ (0x3D63 * 8 + 4)
#define                                 WR2IF_bit           _BIT_ACCESS(I2C2PIR,4)
// NVMCON1<WREN>
extern volatile __bit                   WREN                __at(0x1CF2A);	// @ (0x39E5 * 8 + 2)
#define                                 WREN_bit            _BIT_ACCESS(NVMCON1,2)
// NVMCON1<WRERR>
extern volatile __bit                   WRERR               __at(0x1CF2B);	// @ (0x39E5 * 8 + 3)
#define                                 WRERR_bit           _BIT_ACCESS(NVMCON1,3)
// SMT1STAT<WS>
extern volatile __bit                   WS                  __at(0x1F901);	// @ (0x3F20 * 8 + 1)
#define                                 WS_bit              _BIT_ACCESS(SMT1STAT,1)
// SMT1WIN<WSEL0>
extern volatile __bit                   WSEL0               __at(0x1F918);	// @ (0x3F23 * 8 + 0)
#define                                 WSEL0_bit           _BIT_ACCESS(SMT1WIN,0)
// SMT1WIN<WSEL1>
extern volatile __bit                   WSEL1               __at(0x1F919);	// @ (0x3F23 * 8 + 1)
#define                                 WSEL1_bit           _BIT_ACCESS(SMT1WIN,1)
// SMT1WIN<WSEL2>
extern volatile __bit                   WSEL2               __at(0x1F91A);	// @ (0x3F23 * 8 + 2)
#define                                 WSEL2_bit           _BIT_ACCESS(SMT1WIN,2)
// SMT1WIN<WSEL3>
extern volatile __bit                   WSEL3               __at(0x1F91B);	// @ (0x3F23 * 8 + 3)
#define                                 WSEL3_bit           _BIT_ACCESS(SMT1WIN,3)
// SMT1WIN<WSEL4>
extern volatile __bit                   WSEL4               __at(0x1F91C);	// @ (0x3F23 * 8 + 4)
#define                                 WSEL4_bit           _BIT_ACCESS(SMT1WIN,4)
// CRCXORL<X1>
extern volatile __bit                   X1                  __at(0x1CB31);	// @ (0x3966 * 8 + 1)
#define                                 X1_bit              _BIT_ACCESS(CRCXORL,1)
// CRCXORH<X10>
extern volatile __bit                   X10                 __at(0x1CB3A);	// @ (0x3967 * 8 + 2)
#define                                 X10_bit             _BIT_ACCESS(CRCXORH,2)
// CRCXORH<X11>
extern volatile __bit                   X11                 __at(0x1CB3B);	// @ (0x3967 * 8 + 3)
#define                                 X11_bit             _BIT_ACCESS(CRCXORH,3)
// CRCXORH<X12>
extern volatile __bit                   X12                 __at(0x1CB3C);	// @ (0x3967 * 8 + 4)
#define                                 X12_bit             _BIT_ACCESS(CRCXORH,4)
// CRCXORH<X13>
extern volatile __bit                   X13                 __at(0x1CB3D);	// @ (0x3967 * 8 + 5)
#define                                 X13_bit             _BIT_ACCESS(CRCXORH,5)
// CRCXORH<X14>
extern volatile __bit                   X14                 __at(0x1CB3E);	// @ (0x3967 * 8 + 6)
#define                                 X14_bit             _BIT_ACCESS(CRCXORH,6)
// CRCXORH<X15>
extern volatile __bit                   X15                 __at(0x1CB3F);	// @ (0x3967 * 8 + 7)
#define                                 X15_bit             _BIT_ACCESS(CRCXORH,7)
// CRCXORL<X2>
extern volatile __bit                   X2                  __at(0x1CB32);	// @ (0x3966 * 8 + 2)
#define                                 X2_bit              _BIT_ACCESS(CRCXORL,2)
// CRCXORL<X3>
extern volatile __bit                   X3                  __at(0x1CB33);	// @ (0x3966 * 8 + 3)
#define                                 X3_bit              _BIT_ACCESS(CRCXORL,3)
// CRCXORL<X4>
extern volatile __bit                   X4                  __at(0x1CB34);	// @ (0x3966 * 8 + 4)
#define                                 X4_bit              _BIT_ACCESS(CRCXORL,4)
// CRCXORL<X5>
extern volatile __bit                   X5                  __at(0x1CB35);	// @ (0x3966 * 8 + 5)
#define                                 X5_bit              _BIT_ACCESS(CRCXORL,5)
// CRCXORL<X6>
extern volatile __bit                   X6                  __at(0x1CB36);	// @ (0x3966 * 8 + 6)
#define                                 X6_bit              _BIT_ACCESS(CRCXORL,6)
// CRCXORL<X7>
extern volatile __bit                   X7                  __at(0x1CB37);	// @ (0x3966 * 8 + 7)
#define                                 X7_bit              _BIT_ACCESS(CRCXORL,7)
// CRCXORH<X8>
extern volatile __bit                   X8                  __at(0x1CB38);	// @ (0x3967 * 8 + 0)
#define                                 X8_bit              _BIT_ACCESS(CRCXORH,0)
// CRCXORH<X9>
extern volatile __bit                   X9                  __at(0x1CB39);	// @ (0x3967 * 8 + 1)
#define                                 X9_bit              _BIT_ACCESS(CRCXORH,1)
// PIE1<ZCDIE>
extern volatile __bit                   ZCDIE               __at(0x1CC89);	// @ (0x3991 * 8 + 1)
#define                                 ZCDIE_bit           _BIT_ACCESS(PIE1,1)
// PIR1<ZCDIF>
extern volatile __bit                   ZCDIF               __at(0x1CD09);	// @ (0x39A1 * 8 + 1)
#define                                 ZCDIF_bit           _BIT_ACCESS(PIR1,1)
// ZCDCON<ZCDINTN>
extern volatile __bit                   ZCDINTN             __at(0x1F618);	// @ (0x3EC3 * 8 + 0)
#define                                 ZCDINTN_bit         _BIT_ACCESS(ZCDCON,0)
// ZCDCON<ZCDINTP>
extern volatile __bit                   ZCDINTP             __at(0x1F619);	// @ (0x3EC3 * 8 + 1)
#define                                 ZCDINTP_bit         _BIT_ACCESS(ZCDCON,1)
// IPR1<ZCDIP>
extern volatile __bit                   ZCDIP               __at(0x1CC09);	// @ (0x3981 * 8 + 1)
#define                                 ZCDIP_bit           _BIT_ACCESS(IPR1,1)
// PMD2<ZCDMD>
extern volatile __bit                   ZCDMD               __at(0x1CE10);	// @ (0x39C2 * 8 + 0)
#define                                 ZCDMD_bit           _BIT_ACCESS(PMD2,0)
// ZCDCON<ZCDOUT>
extern volatile __bit                   ZCDOUT              __at(0x1F61D);	// @ (0x3EC3 * 8 + 5)
#define                                 ZCDOUT_bit          _BIT_ACCESS(ZCDCON,5)
// ZCDCON<ZCDPOL>
extern volatile __bit                   ZCDPOL              __at(0x1F61C);	// @ (0x3EC3 * 8 + 4)
#define                                 ZCDPOL_bit          _BIT_ACCESS(ZCDCON,4)
// ZCDCON<ZCDSEN>
extern volatile __bit                   ZCDSEN              __at(0x1F61F);	// @ (0x3EC3 * 8 + 7)
#define                                 ZCDSEN_bit          _BIT_ACCESS(ZCDCON,7)
// STATUS<ZERO>
extern volatile __bit                   ZERO                __at(0x1FEC2);	// @ (0x3FD8 * 8 + 2)
#define                                 ZERO_bit            _BIT_ACCESS(STATUS,2)
// PCON0<nBOR>
extern volatile __bit                   nBOR                __at(0x1FF80);	// @ (0x3FF0 * 8 + 0)
#define                                 nBOR_bit            _BIT_ACCESS(PCON0,0)
// PCON1<nMEMV>
extern volatile __bit                   nMEMV               __at(0x1FF89);	// @ (0x3FF1 * 8 + 1)
#define                                 nMEMV_bit           _BIT_ACCESS(PCON1,1)
// PCON0<nPOR>
extern volatile __bit                   nPOR                __at(0x1FF81);	// @ (0x3FF0 * 8 + 1)
#define                                 nPOR_bit            _BIT_ACCESS(PCON0,1)
// PCON0<nRI>
extern volatile __bit                   nRI                 __at(0x1FF82);	// @ (0x3FF0 * 8 + 2)
#define                                 nRI_bit             _BIT_ACCESS(PCON0,2)
// PCON0<nRMCLR>
extern volatile __bit                   nRMCLR              __at(0x1FF83);	// @ (0x3FF0 * 8 + 3)
#define                                 nRMCLR_bit          _BIT_ACCESS(PCON0,3)
// PCON0<nRWDT>
extern volatile __bit                   nRWDT               __at(0x1FF84);	// @ (0x3FF0 * 8 + 4)
#define                                 nRWDT_bit           _BIT_ACCESS(PCON0,4)
// PCON0<nWDTWV>
extern volatile __bit                   nWDTWV              __at(0x1FF85);	// @ (0x3FF0 * 8 + 5)
#define                                 nWDTWV_bit          _BIT_ACCESS(PCON0,5)

#endif // _PIC18F57K42_H_
